import random

investment_tips = [
    "هیچ‌وقت بیشتر از ۲٪ سرمایت رو در یک معامله ریسک نکن.",
    "تنوع در معاملات باعث کاهش ریسک کلی سبدت می‌شه.",
    "مدیریت سرمایه یعنی اول محافظت از اصل پول، بعد سود.",
    "پلن معاملاتی بدون مدیریت سرمایه، مثل رانندگی با چشم بسته‌ست.",
    "قبل از ورود به معامله، حد ضرر رو مشخص کن؛ نه بعدش!"
]

psychology_tips = [
    "تریدر موفق کسیه که احساساتش رو مدیریت کنه، نه بازار رو.",
    "ترس و طمع، دو دشمن اصلی تریدر هستن. هر روز باهاشون بجنگ.",
    "صبوری توی معامله بیشتر از تحلیل مهمه.",
    "هر ضرر یه درسه، نه یه شکست. یاد بگیر، ادامه بده.",
    "فکر نکن بازار بهت بدهکاره. هیچ‌وقت!"
]

def get_random_tip():
    return random.choice(investment_tips)

def get_random_psychology():
    return random.choice(psychology_tips)
